---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeSettings.FlatOnBottom
source: html/8ec7fb54-c9bf-542b-3335-ce20bc11caf7.htm
---
# Autodesk.Revit.DB.Plumbing.PipeSettings.FlatOnBottom Property

The abbreviation of the Flat On Bottom (FOB) string.

## Syntax (C#)
```csharp
public string FlatOnBottom { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null